{
  "agentSessionTimeout": "10m",
  "messageCount": 10,
  "handoffAlert": 5,
  "defaultUsername": false,
  "autoAssignConversations": false,
  "tags": [],
  "enableConversationDeletion": false,
  "transferMessage": {
    "en": "You are being transferred to an agent.",
    "fr": "Vous êtes transféré à un agent.",
    "es": "Se le está transfiriendo a un agente."
  },
  "assignMessage": {
    "en": "You have been assigned to our agent {{agentName}}.",
    "fr": "Vous avez été assigné à notre agent(e) {{agentName}}.",
    "es": "Ha sido asignado al agente {{agentName}}."
  },
  "resolveMessage": {
    "en": "You are being transferred back to the bot.",
    "fr": "Vous êtes transféré au bot.",
    "es": "Se le está transfiriendo de vuelta al bot."
  },
  "reassignMessage": {
    "en": "Agent {{agentName}} has reassigned your conversation. Looking for another available agent, please wait a moment.",
    "fr": "L'agent {{agentName}} a réassigné votre conversation. Recherche d'un autre agent disponible, veuillez patienter un instant.",
    "es": "El agente {{agentName}} ha reasignado su conversación. Buscando otro agente disponible, espere un momento."
  },
  "reassignedMessage": {
    "en": "Your conversation has been reassigned to agent {{agentName}}.",
    "fr": "Votre conversation a été réassignée à l'agent {{agentName}}.",
    "es": "Su conversación ha sido reasignada al agente {{agentName}}."
  },
  "returnToBotMessage": {
    "en": "Sorry, no agents are currently available. Your conversation has been returned to me. I'll try to help you resolve your issue or can create a ticket for you.",
    "fr": "Désolé, aucun agent n'est actuellement disponible. Votre conversation m'a été renvoyée. Je vais essayer de vous aider à résoudre votre problème ou je peux créer un ticket pour vous.",
    "es": "Lo siento, no hay agentes disponibles actualmente. Su conversación me ha sido devuelta. Intentaré ayudarlo a resolver su problema o puedo crear un ticket para usted."
  },
  "eventsWebHook": {},
  "s3Config": {
    "accessKeyId": "YOUR_AWS_ACCESS_KEY_ID",
    "secretAccessKey": "YOUR_AWS_SECRET_ACCESS_KEY",
    "region": "us-east-1",
    "bucket": "your-hitlnext-uploads-bucket"
  },
  "autoComplete": {
    "trigger": ":",
    "shortcuts": [
      {
        "name": "hello",
        "value": "Hello! How can I help you today?"
      },
      {
        "name": "thanks",
        "value": "Thank you for contacting us. Have a great day!"
      }
    ]
  }
}
